Revit 2026 API
FilteredElementCollector Constructor
Overload List
Name | Description
FilteredElementCollector(Document) |  Constructs a new FilteredElementCollector that will search and filter the set of elements in a document.
FilteredElementCollector(Document, ElementId) |  Constructs a new FilteredElementCollector that will search and filter the visible elements in a view.
FilteredElementCollector(Document, ICollection<ElementId>) | Initializes a new instance of the FilteredElementCollector class
FilteredElementCollector(Document, ElementId, ElementId) |  Constructs a new FilteredElementCollector that will search and filter the visible elements from a Revit link in a host document view.
Top
See Also
Reference
FilteredElementCollector Class
Autodesk.Revit.DB Namespace